{
  "format": "layers-model",
  "generatedBy": "keras v3.8.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "3.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_5",
        "trainable": true,
        "dtype": "float32",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_shape": [null, 100],
              "input_shape": [100],
              "dtype": "float32",
              "sparse": false,
              "name": "input_layer_5"
            }
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_4",
              "trainable": true,
              "dtype": "float32",
              "input_dim": 1000,
              "output_dim": 16,
              "input_shape": [100],
              "embeddings_initializer": {
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null }
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false
            }
          },
          {
            "class_name": "GlobalAveragePooling1D",
            "config": {
              "name": "global_average_pooling1d_4",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last",
              "keepdims": false
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_8",
              "trainable": true,
              "dtype": "float32",
              "units": 16,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_9",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ],
        "build_input_shape": [null, 100]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "sequential_5/dense_8/kernel",
          "shape": [16, 16],
          "dtype": "float32"
        },
        {
          "name": "sequential_5/dense_8/bias",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "sequential_5/dense_9/kernel",
          "shape": [16, 1],
          "dtype": "float32"
        },
        {
          "name": "sequential_5/dense_9/bias",
          "shape": [1],
          "dtype": "float32"
        },
        {
          "name": "sequential_5/embedding_4/embeddings",
          "shape": [1000, 16],
          "dtype": "float32"
        }
      ]
    }
  ]
}
